InformationRegisters/УчетнаяПолитикаПоНалоговомуУчету.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>УчетнаяПолитикаПоНалоговомуУчету</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПлательщикОППВ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименятьОграничениеНаМинимальныйОбъектОСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредоставлятьВычетВМесяцеОтсутствияДохода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтражатьУдержаниеНалоговИВзносовПропорциональноВыплаченномуДоходу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименятьВычетВОСМСДляФизическихЛицИГПХ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименятьВычетОПВиВОСМСДляГПХ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СистемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗаявленногоДоходаИП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияПоДоходуСубъектаПредпринимательства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокОбложенияДоходовРаботников</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокОбложенияДоходовРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЮридическоеФизическоеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ЮридическоеФизическоеЛицо</Name>
			<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СистемыНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СистемыНалогообложения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Общая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Упрощенная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РозничныйНалог</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/УчетнаяПолитикаПоНалоговомуУчету/Forms/РедактированиеИстории/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("ВедущийОбъект", ОбъектВладелец);
	Если Не ЗначениеЗаполнено(ОбъектВладелец) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// ЗУПК
	ОрганизацияЯвляетсяИП = (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектВладелец, "ЮридическоеФизическоеЛицо") = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо);
	// ЗУПК
	
	// Если объект еще не заблокирован для изменений и есть права на изменение набора
	// попытаемся установить блокировку.
    Если НЕ ПравоДоступа("Изменение", Метаданные.РегистрыСведений.УчетнаяПолитикаПоНалоговомуУчету) Тогда
        
        ТолькоПросмотр = Истина;
        
	КонецЕсли;
	
	Если ТолькоПросмотр Тогда
		
		Элементы.НаборЗаписей.ТолькоПросмотр = Истина;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, 
			"ФормаКомандаОК",
			"Доступность",
			Ложь);
			
		Элементы.ФормаКомандаОтмена.КнопкаПоУмолчанию = Истина;
		
	КонецЕсли;
		
	Для Каждого ЗаписьНабора Из Параметры.МассивЗаписей Цикл
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), ЗаписьНабора);
	КонецЦикла;
	
	НаборЗаписей.Сортировать("Период");
	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДатеВТабличнойЧасти(НаборЗаписей, "Период", "ПериодСтрокой");	
	
КонецПроцедуры

#Область ОбработчикиСобытийТаблицыФормыНаборЗаписей

&НаКлиенте
Процедура НаборЗаписейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Если Элемент.ТекущиеДанные <> Неопределено Тогда
			Элемент.ТекущиеДанные.Организация = ОбъектВладелец;
			НовыйПериод = НачалоМесяца(ОбщегоНазначенияКлиент.ДатаСеанса());
			Если НаборЗаписей.Количество() > 1 Тогда
				ПоследнийПериод = НаборЗаписей.Получить(НаборЗаписей.Количество() - 2).Период;
			Иначе
				ПоследнийПериод = '00010101000000';
			КонецЕсли; 
			Если НовыйПериод <= ПоследнийПериод Тогда
				НовыйПериод = ДобавитьМесяц(ПоследнийПериод, 1);
			КонецЕсли; 
			Элемент.ТекущиеДанные.Период = НовыйПериод;
            ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(Элемент.ТекущиеДанные, "Период", "ПериодСтрокой");
            Если Копирование Тогда
				Если НЕ (Элемент.ТекущиеДанные.Период >= '20200101'
					И Элемент.ТекущиеДанные.Период < '20210101') Тогда
                    Элемент.ТекущиеДанные.НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений = Ложь;
                    Элемент.ТекущиеДанные.ПрименятьВычетВОСМСДляФизическихЛицИГПХ = Ложь;
                    Элемент.ТекущиеДанные.ПрименятьВычетОПВиВОСМСДляГПХ = Ложь;
               КонецЕсли; 
            КонецЕсли; 
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура НаборЗаписейПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если НЕ ОтменаРедактирования Тогда
		Если Элемент.ТекущиеДанные <> Неопределено Тогда
			Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Период) Тогда
				СообщениеОбОшибке = НСтр("ru = 'Необходимо указать месяц, с которого будет действовать настройка'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке,,"НаборЗаписей.Период", , Отказ);
			Иначе
				НайденныеСтроки = НаборЗаписей.НайтиСтроки(Новый Структура("Период", Элемент.ТекущиеДанные.Период));
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					Если НайденнаяСтрока <> Элемент.ТекущиеДанные Тогда
						СообщениеОбОшибке = НСтр("ru = 'Уже есть запись с указанным месяцем начала действия настройки'");
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке,,"НаборЗаписей.Период", , Отказ);
						Прервать;
					КонецЕсли; 
				КонецЦикла;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура НаборЗаписейПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	РедактированиеПериодическихСведенийКлиент.УпорядочитьНаборЗаписейВФорме(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСтрокойПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(Элементы.НаборЗаписей.ТекущиеДанные, "Период", "ПериодСтрокой", Модифицированность);
	ОбновитьЗначениеНастроекПоПериоду(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ПериодСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтаФорма, Элементы.НаборЗаписей.ТекущиеДанные, "Период", "ПериодСтрокой", Модифицированность);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(Элементы.НаборЗаписей.ТекущиеДанные, "Период", "ПериодСтрокой", Направление, Модифицированность);
	ОбновитьЗначениеНастроекПоПериоду(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	ОбновитьЗначениеНастроекПоПериоду(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НаборЗаписейПрименятьВычетВОСМСДляФизическихЛицИГПХПриИзменении(Элемент)
	
	Если Элементы.НаборЗаписей.ТекущиеДанные.Период >= '2020-01-01'
		И (Элементы.НаборЗаписей.ТекущиеДанные.ПрименятьВычетВОСМСДляФизическихЛицИГПХ = Истина 
		И НЕ Элементы.НаборЗаписей.ТекущиеДанные.НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений) Тогда
		
		Элементы.НаборЗаписей.ТекущиеДанные.НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений = Истина;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Настройка ""Расчет СН, ООСМС, ВОСМС без применения 90% корректировки по ИПН"" установлена. Корректировка дохода не может использоваться совместно с предоставлением вычета ВОСМС.'"));
			
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура НаборЗаписейНеПрименятьКорректировкуПрочихНалоговВзносовОтчисленийПриИзменении(Элемент)
	
	Если Элементы.НаборЗаписей.ТекущиеДанные.Период >= '2020-01-01'
		И (НЕ Элементы.НаборЗаписей.ТекущиеДанные.НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений
		И Элементы.НаборЗаписей.ТекущиеДанные.ПрименятьВычетВОСМСДляФизическихЛицИГПХ) Тогда
		
		Элементы.НаборЗаписей.ТекущиеДанные.ПрименятьВычетВОСМСДляФизическихЛицИГПХ = Ложь;	
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Настройка ""Применять вычет ВОСМС для физических лиц (сотрудников)"" снята. Вычет ВОСМС не может использоваться совместно с корректировкой дохода'"));
			
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЗначениеНастроекПоПериоду(Форма)
    
	ТекущиеДанные = Форма.Элементы.НаборЗаписей.ТекущиеДанные;
	
	Если ТекущиеДанные.Период >= '2024-01-01' Тогда
        ТекущиеДанные.НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений = Ложь;
        ТекущиеДанные.ПрименятьВычетВОСМСДляФизическихЛицИГПХ = Ложь;
        ТекущиеДанные.ПрименятьВычетОПВиВОСМСДляГПХ = Ложь;
	ИначеЕсли ТекущиеДанные.Период >= '2021-01-01' Тогда
        ТекущиеДанные.НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений = Ложь;
        ТекущиеДанные.ПрименятьВычетВОСМСДляФизическихЛицИГПХ = Ложь;
        ТекущиеДанные.ПрименятьВычетОПВиВОСМСДляГПХ = Ложь;
		Если ТекущиеДанные.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.РозничныйНалог") Тогда
			ТекущиеДанные.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.Общая");
		КонецЕсли;
	ИначеЕсли ТекущиеДанные.Период >= '2019-01-01' Тогда
		ТекущиеДанные.НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений = Ложь;
	    ТекущиеДанные.ПрименятьВычетВОСМСДляФизическихЛицИГПХ = Ложь;
        ТекущиеДанные.ПрименятьВычетОПВиВОСМСДляГПХ = Ложь;
        ТекущиеДанные.СистемаНалогообложения = Неопределено;
        ТекущиеДанные.СуммаЗаявленногоДоходаИП = 0;
        ТекущиеДанные.КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя = 0;
        ТекущиеДанные.КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника = 0;
    Иначе
    	ТекущиеДанные.НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений = Ложь;
        ТекущиеДанные.ПрименятьВычетВОСМСДляФизическихЛицИГПХ = Ложь;
        ТекущиеДанные.ПрименятьВычетОПВиВОСМСДляГПХ = Ложь;
        ТекущиеДанные.СистемаНалогообложения = Неопределено;
        ТекущиеДанные.СуммаЗаявленногоДоходаИП = 0;
        ТекущиеДанные.КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя = 0;
        ТекущиеДанные.КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника = 0;
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура НаборЗаписейОрганизацияЯвляетсяПлательщикомСНПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Элементы.НаборЗаписей.ТекущиеДанные.СистемаНалогообложения)
		ИЛИ ЗначениеЗаполнено(Элементы.НаборЗаписей.ТекущиеДанные.СистемаНалогообложения) = ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.Общая") Тогда
		
		Элементы.НаборЗаписей.ТекущиеДанные.КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя = 0;	
		Элементы.НаборЗаписей.ТекущиеДанные.КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника = 0;	
			
	КонецЕсли;		
	
	ТекущиеДанные = ЭтаФорма.Элементы.НаборЗаписей.ТекущиеДанные;
	
	Если ТекущиеДанные.Период < '2024-01-01' И ТекущиеДанные.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.РозничныйНалог") Тогда
		ТекущиеДанные.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.Общая");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	РедактированиеПериодическихСведенийКлиент.ОповеститьОЗавершении(ЭтаФорма, "УчетнаяПолитикаПоНалоговомуУчету", ОбъектВладелец);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти
